{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ad07c3a3",
   "metadata": {},
   "source": [
    "# Knowledge Graph Demo\n",
    "\n",
    "This notebook demonstrates how the Neo4j knowledge graph can be queried using Cypher.\n",
    "The graph models courses, prerequisites, degrees, and student paths.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "138f0a5e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "URI = \"bolt://localhost:7687\"\n",
    "USER = \"neo4j\"\n",
    "PASSWORD = \"password\"  # adapte si nécessaire\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=(USER, PASSWORD))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "48a0dc57",
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_query(query):\n",
    "    with driver.session() as session:\n",
    "        return session.run(query).data()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1ba41986",
   "metadata": {},
   "source": [
    "## Example 1: List all the courses\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "55f588d7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'course': 'AAS 100'},\n",
       " {'course': 'AAS 105'},\n",
       " {'course': 'AAS 120'},\n",
       " {'course': 'AAS 199'},\n",
       " {'course': 'AAS 200'},\n",
       " {'course': 'AAS 201'},\n",
       " {'course': 'AAS 211'},\n",
       " {'course': 'AAS 215'},\n",
       " {'course': 'AFRO 100'},\n",
       " {'course': 'AIS 101'}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (c:Course)\n",
    "RETURN c.code AS course\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "run_query(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a2b73b29",
   "metadata": {},
   "source": [
    "## Example 2: Direct prerequisites of a course\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "bf79a1c6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'relationshipType': 'SHARED_AUDIENCE'},\n",
       " {'relationshipType': 'PRE_REQUIRES'},\n",
       " {'relationshipType': 'REQUIRED_FOR'},\n",
       " {'relationshipType': 'ENROLLED_IN'},\n",
       " {'relationshipType': 'HAS_COMPLETED'},\n",
       " {'relationshipType': 'OFFERED_IN'}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL db.relationshipTypes()\"\n",
    "run_query(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "3b4c50f4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Course)-[:PRE_REQUIRES]->(c:Course {code: \"CS200\"})\n",
    "RETURN p.code AS prerequisite\n",
    "\"\"\"\n",
    "run_query(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ee13f5ec",
   "metadata": {},
   "source": [
    "## Example 3: Possible graduation paths\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "be5599d6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH path = (start:Course {code: \"CS100\"})-[:PRE_REQUIRES*]->(end:Course)\n",
    "RETURN path\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "run_query(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d98d7aa2",
   "metadata": {},
   "source": [
    "## Conclusion\n",
    "\n",
    "This demo illustrates how the knowledge graph enables complex academic queries\n",
    "such as prerequisite resolution and curriculum path exploration.\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "adri",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
